Extensions/БИТ_Доработки_НДЭ/Documents/Фасовка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Фасовка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовФасовка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Станок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сырье</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЧастьКомплектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БИТ_КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоМатериал</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/Enums/СтатусыДокументовФасовка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовФасовка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/Documents/Фасовка/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область НастройкаПолейФормыИОтборов
&НаКлиенте
Процедура СтанокНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)	
	// Отключаем стандартную обработку
	СтандартнаяОбработка = Ложь;
	
	// Вызываем серверную процедуру для получения ссылки на категорию
	ОборудованиеСсылка = ПолучитьКатегориюОборудованиеНаСервере();
	
	// Создаем оповещение для обработки выбора
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборОборудования", ЭтотОбъект);
	
	Если ОборудованиеСсылка <> Неопределено Тогда
		// Создаем отбор
		Отбор = Новый Структура("КатегорияНоменклатуры", ОборудованиеСсылка);
		
		// Параметры открытия формы выбора
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("Отбор", Отбор);
		
		// Открываем форму выбора с оповещением
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элемент, , , , Оповещение);
	Иначе
		// Если категория не найдена, открываем обычный выбор
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", , Элемент, , , , Оповещение);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьКатегориюОборудованиеНаСервере()
	Возврат Справочники.КатегорииНоменклатуры.НайтиПоНаименованию("Оборудование");
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборОборудования(ВыбранноеЗначение, ПараметрыВыбора) Экспорт	
	Если ВыбранноеЗначение = Неопределено Тогда
		Объект.Станок = ВыбранноеЗначение;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеВыбораДляПоляВвода(Текст)

    ДанныеВыбора = Новый СписокЗначений;
    ОборудованиеСсылка = ПолучитьКатегориюОборудованиеНаСервере();
	Если ОборудованиеСсылка = Неопределено Тогда
		Возврат ДанныеВыбора;
	КонецЕсли;
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Номенклатура.Ссылка КАК Ссылка
    |ИЗ
    |	Справочник.Номенклатура КАК Номенклатура
    |ГДЕ
    |	Номенклатура.КатегорияНоменклатуры = &КатегорияНоменклатуры
    |	И (Номенклатура.Наименование ПОДОБНО &Шаблон
    |			ИЛИ Номенклатура.Артикул ПОДОБНО &Шаблон)
    |
    |УПОРЯДОЧИТЬ ПО
    |	Номенклатура.Наименование";
    
    Запрос.УстановитьПараметр("КатегорияНоменклатуры", ОборудованиеСсылка);
    Запрос.УстановитьПараметр("Шаблон", "%" + Текст + "%");

    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
        Возврат ДанныеВыбора;
    КонецЕсли;
    
    ТаблицаЗапроса = Результат.Выгрузить();
    ДанныеВыбора.ЗагрузитьЗначения(ТаблицаЗапроса.ВыгрузитьКолонку("Ссылка"));
    
    Возврат ДанныеВыбора; 
	
КонецФункции

&НаКлиенте
Процедура СтанокАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

    Если Не ПустаяСтрока(Текст) Тогда
        СтандартнаяОбработка = Ложь;
        ДанныеВыбора = ПолучитьДанныеВыбораДляПоляВвода(Текст);
    КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	// Отключаем стандартный механизм выбора, чтобы подставить свой список
	СтандартнаяОбработка = Ложь;
	
	// Получаем список сотрудников-фасовщиков с сервера
	МассивСсылок = ПолучитьФасовщиковНаСервере();
	
	// Очищаем старый список и загружаем новый
	Элемент.СписокВыбора.Очистить();
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивСсылок);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФасовщиковНаСервере()
	
	// 1. Получаем актуальные должности на текущую дату из регистра сведений
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	СотрудникиСрезПоследних.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних КАК СотрудникиСрезПоследних
	|		ПО Сотрудники.Ссылка = СотрудникиСрезПоследних.Сотрудник
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.Наименование ПОДОБНО &Родитель
	|	И Сотрудники.Недействителен = ЛОЖЬ
	|	И Сотрудники.ВАрхиве = ЛОЖЬ
	|	И СотрудникиСрезПоследних.Должность.Наименование ПОДОБНО &Наименование";  
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.Должность КАК Должность,
	|	СотрудникиСрезПоследних.Должность.Наименование КАК ДолжностьНаименование
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних КАК СотрудникиСрезПоследних
	|		внутреннее СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО СотрудникиСрезПоследних.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	СотрудникиСрезПоследних.Должность.Наименование ПОДОБНО &Должность
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.Родитель.Наименование ПОДОБНО &Родитель
	|	И Сотрудники.ВАрхиве = ЛОЖЬ";
	
	// 2. Настройка параметров (ищем слова "фасовщик" в любом месте)
	Запрос.УстановитьПараметр("Должность", "%фасовщик%");
	Запрос.УстановитьПараметр("Родитель", "склад");
	
	// 3. Выполняем и выгружаем результат в простой массив
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    // Заполняем автора, только если это новый документ и поле еще не заполнено
    Если НЕ ЗначениеЗаполнено(Объект.Автор) И Объект.Ссылка.Пустая() Тогда
        Объект.Автор = Пользователи.ТекущийПользователь();
		Объект.Организация = Справочники.Организации.НайтиПоНаименованию("Дубровский Андрей Леонидович");
		Объект.СтатусДокумента = Перечисления.СтатусыДокументовФасовка.ВРаботе;
    КонецЕсли;

КонецПроцедуры


#Область НеиспользуемыеПроцедуры

//&НаСервере
//Процедура ЗаполнитьПоСпецификации(Номенклатура)
//    
//    // Проверяем, что номенклатура заполнена
//    Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
//        Возврат;
//    КонецЕсли;
//    
//    // Получаем спецификацию по умолчанию для этой номенклатуры
//    Запрос = Новый Запрос;
//    Запрос.Текст = 
//    "ВЫБРАТЬ ПЕРВЫЕ 1
//    |	Спецификации.Ссылка КАК Спецификация
//    |ИЗ
//    |	Справочник.Спецификации КАК Спецификации
//    |ГДЕ
//    |	Спецификации.Владелец = &Номенклатура";
//    
//    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//    Результат = Запрос.Выполнить();
//    Выборка = Результат.Выбрать();
//    
//    Если Выборка.Следующий() Тогда
//        ЗаполнитьСырьеПоСпецификации(Выборка.Спецификация);
//    КонецЕсли;
//    
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьСырьеПоСпецификации(Спецификация)
//    
//    // Запрашиваем состав спецификации
//    Запрос = Новый Запрос;
//    Запрос.Текст = 
//    "ВЫБРАТЬ
//    |    Состав.Номенклатура КАК Номенклатура,
//    |    Состав.Количество КАК Количество,
//    |    Состав.ЕдиницаИзмерения КАК ЕдиницаИзмерения
//    |ИЗ
//    |    Справочник.Спецификации.Состав КАК Состав
//    |ГДЕ
//    |    Состав.Ссылка = &Спецификация";
//    
//    Запрос.УстановитьПараметр("Спецификация", Спецификация);
//    Результат = Запрос.Выполнить();
//    Выборка = Результат.Выбрать();
//    
//    // Заполняем табличную часть Сырье
//    Пока Выборка.Следующий() Цикл
//        НоваяСтрока = Объект.Сырье.Добавить();
//        НоваяСтрока.Номенклатура = Выборка.Номенклатура;
//        НоваяСтрока.Количество = Выборка.Количество;
//        НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
//    КонецЦикла;
//    
//КонецПроцедуры
//&НаСервереБезКонтекста
//Функция ПолучитьЕдиницуИзмерения(Номенклатура)
//	Возврат Номенклатура.ЕдиницаИзмерения;
//КонецФункции

//&НаКлиенте
//Процедура ПродукцияНоменклатураПриИзменении(Элемент) 
//	
//	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
//	Если СтрокаТабличнойЧасти = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(СтрокаТабличнойЧасти.Номенклатура);
//    СтрокаТабличнойЧасти.Количество = 1;
//    ЗаполнитьПоСпецификации(СтрокаТабличнойЧасти.Номенклатура);
//КонецПроцедуры

//&НаСервере
//Процедура ПродукцияКоличествоПриИзмененииНаСервере(Номенклатура, Количество)
//	Запрос = Новый Запрос;
//    Запрос.Текст = 
//    "ВЫБРАТЬ ПЕРВЫЕ 1
//    |	Спецификации.Ссылка КАК Спецификация
//    |ИЗ
//    |	Справочник.Спецификации КАК Спецификации
//    |ГДЕ
//    |	Спецификации.Владелец = &Номенклатура";
//    
//    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//    Результат = Запрос.Выполнить();
//    Выборка = Результат.Выбрать();
//    
//    Если Выборка.Следующий() Тогда
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|    Состав.Номенклатура КАК Номенклатура,
//		|    Состав.Количество КАК Количество,
//		|    Состав.ЕдиницаИзмерения КАК ЕдиницаИзмерения
//	    |ИЗ
//	    |    Справочник.Спецификации.Состав КАК Состав
//	    |ГДЕ
//	    |    Состав.Ссылка = &Спецификация";
//	    
//	    Запрос.УстановитьПараметр("Спецификация", Выборка.Спецификация);
//	    Результат = Запрос.Выполнить();
//	    Выборка = Результат.Выбрать();
//	    
//	    // Заполняем табличную часть Сырье
//	    Пока Выборка.Следующий() Цикл
//			//НоваяСтрока = Объект.Сырье;
//			//НоваяСтрока.Номенклатура = Выборка.Номенклатура;
//			//НоваяСтрока.Количество = Выборка.Количество;
//			//НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
//			Для Каждого СтрокаТЧ Из Объект.Сырье Цикл
//		    	Если СтрокаТЧ.Номенклатура = Выборка.Номенклатура Тогда
//		        	// Строка найдена - делаем с ней что-то
//		        	СтрокаТЧ.Количество = Выборка.Количество*Количество;
//		        	Прервать;
//		    	КонецЕсли;
//			КонецЦикла;
//	    КонецЦикла;
//    КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияКоличествоПриИзменении(Элемент)
//	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
//	Если СтрокаТабличнойЧасти = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	Количество = СтрокаТабличнойЧасти.Количество;
//	ПродукцияКоличествоПриИзмененииНаСервере(СтрокаТабличнойЧасти.Номенклатура, Количество);
//КонецПроцедуры

#КонецОбласти
